GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k42.inc
// Register: CCDNC
#define CCDNC CCDNC
CCDNC                                    equ 03A69h
// bitfield definitions
CCDNC_CCDNC0_POSN                        equ 0000h
CCDNC_CCDNC0_POSITION                    equ 0000h
CCDNC_CCDNC0_SIZE                        equ 0001h
CCDNC_CCDNC0_LENGTH                      equ 0001h
CCDNC_CCDNC0_MASK                        equ 0001h
CCDNC_CCDNC1_POSN                        equ 0001h
CCDNC_CCDNC1_POSITION                    equ 0001h
CCDNC_CCDNC1_SIZE                        equ 0001h
CCDNC_CCDNC1_LENGTH                      equ 0001h
CCDNC_CCDNC1_MASK                        equ 0002h
CCDNC_CCDNC2_POSN                        equ 0002h
CCDNC_CCDNC2_POSITION                    equ 0002h
CCDNC_CCDNC2_SIZE                        equ 0001h
CCDNC_CCDNC2_LENGTH                      equ 0001h
CCDNC_CCDNC2_MASK                        equ 0004h
CCDNC_CCDNC3_POSN                        equ 0003h
CCDNC_CCDNC3_POSITION                    equ 0003h
CCDNC_CCDNC3_SIZE                        equ 0001h
CCDNC_CCDNC3_LENGTH                      equ 0001h
CCDNC_CCDNC3_MASK                        equ 0008h
CCDNC_CCDNC4_POSN                        equ 0004h
CCDNC_CCDNC4_POSITION                    equ 0004h
CCDNC_CCDNC4_SIZE                        equ 0001h
CCDNC_CCDNC4_LENGTH                      equ 0001h
CCDNC_CCDNC4_MASK                        equ 0010h
CCDNC_CCDNC5_POSN                        equ 0005h
CCDNC_CCDNC5_POSITION                    equ 0005h
CCDNC_CCDNC5_SIZE                        equ 0001h
CCDNC_CCDNC5_LENGTH                      equ 0001h
CCDNC_CCDNC5_MASK                        equ 0020h
CCDNC_CCDNC6_POSN                        equ 0006h
CCDNC_CCDNC6_POSITION                    equ 0006h
CCDNC_CCDNC6_SIZE                        equ 0001h
CCDNC_CCDNC6_LENGTH                      equ 0001h
CCDNC_CCDNC6_MASK                        equ 0040h
CCDNC_CCDNC7_POSN                        equ 0007h
CCDNC_CCDNC7_POSITION                    equ 0007h
CCDNC_CCDNC7_SIZE                        equ 0001h
CCDNC_CCDNC7_LENGTH                      equ 0001h
CCDNC_CCDNC7_MASK                        equ 0080h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 03A6Ah
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0001h
RC3I2C_SLEW_LENGTH                       equ 0001h
RC3I2C_SLEW_MASK                         equ 0040h
RC3I2C_TH0_POSN                          equ 0000h
RC3I2C_TH0_POSITION                      equ 0000h
RC3I2C_TH0_SIZE                          equ 0001h
RC3I2C_TH0_LENGTH                        equ 0001h
RC3I2C_TH0_MASK                          equ 0001h
RC3I2C_TH1_POSN                          equ 0001h
RC3I2C_TH1_POSITION                      equ 0001h
RC3I2C_TH1_SIZE                          equ 0001h
RC3I2C_TH1_LENGTH                        equ 0001h
RC3I2C_TH1_MASK                          equ 0002h
RC3I2C_PU0_POSN                          equ 0004h
RC3I2C_PU0_POSITION                      equ 0004h
RC3I2C_PU0_SIZE                          equ 0001h
RC3I2C_PU0_LENGTH                        equ 0001h
RC3I2C_PU0_MASK                          equ 0010h
RC3I2C_PU1_POSN                          equ 0005h
RC3I2C_PU1_POSITION                      equ 0005h
RC3I2C_PU1_SIZE                          equ 0001h
RC3I2C_PU1_LENGTH                        equ 0001h
RC3I2C_PU1_MASK                          equ 0020h
RC3I2C_I2CTH_POSN                        equ 0000h
RC3I2C_I2CTH_POSITION                    equ 0000h
RC3I2C_I2CTH_SIZE                        equ 0002h
RC3I2C_I2CTH_LENGTH                      equ 0002h
RC3I2C_I2CTH_MASK                        equ 0003h
RC3I2C_I2CPU_POSN                        equ 0004h
RC3I2C_I2CPU_POSITION                    equ 0004h
RC3I2C_I2CPU_SIZE                        equ 0002h
RC3I2C_I2CPU_LENGTH                      equ 0002h
RC3I2C_I2CPU_MASK                        equ 0030h
RC3I2C_I2CSLEW_POSN                      equ 0006h
RC3I2C_I2CSLEW_POSITION                  equ 0006h
RC3I2C_I2CSLEW_SIZE                      equ 0001h
RC3I2C_I2CSLEW_LENGTH                    equ 0001h
RC3I2C_I2CSLEW_MASK                      equ 0040h
RC3I2C_I2CTH0_POSN                       equ 0000h
RC3I2C_I2CTH0_POSITION                   equ 0000h
RC3I2C_I2CTH0_SIZE                       equ 0001h
RC3I2C_I2CTH0_LENGTH                     equ 0001h
RC3I2C_I2CTH0_MASK                       equ 0001h
RC3I2C_I2CTH1_POSN                       equ 0001h
RC3I2C_I2CTH1_POSITION                   equ 0001h
RC3I2C_I2CTH1_SIZE                       equ 0001h
RC3I2C_I2CTH1_LENGTH                     equ 0001h
RC3I2C_I2CTH1_MASK                       equ 0002h
RC3I2C_I2CPU0_POSN                       equ 0004h
RC3I2C_I2CPU0_POSITION                   equ 0004h
RC3I2C_I2CPU0_SIZE                       equ 0001h
RC3I2C_I2CPU0_LENGTH                     equ 0001h
RC3I2C_I2CPU0_MASK                       equ 0010h
RC3I2C_I2CPU1_POSN                       equ 0005h
RC3I2C_I2CPU1_POSITION                   equ 0005h
RC3I2C_I2CPU1_SIZE                       equ 0001h
RC3I2C_I2CPU1_LENGTH                     equ 0001h
RC3I2C_I2CPU1_MASK                       equ 0020h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 03A6Bh
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0001h
RC4I2C_SLEW_LENGTH                       equ 0001h
RC4I2C_SLEW_MASK                         equ 0040h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_PU0_POSN                          equ 0004h
RC4I2C_PU0_POSITION                      equ 0004h
RC4I2C_PU0_SIZE                          equ 0001h
RC4I2C_PU0_LENGTH                        equ 0001h
RC4I2C_PU0_MASK                          equ 0010h
RC4I2C_PU1_POSN                          equ 0005h
RC4I2C_PU1_POSITION                      equ 0005h
RC4I2C_PU1_SIZE                          equ 0001h
RC4I2C_PU1_LENGTH                        equ 0001h
RC4I2C_PU1_MASK                          equ 0020h
RC4I2C_I2CTH_POSN                        equ 0000h
RC4I2C_I2CTH_POSITION                    equ 0000h
RC4I2C_I2CTH_SIZE                        equ 0002h
RC4I2C_I2CTH_LENGTH                      equ 0002h
RC4I2C_I2CTH_MASK                        equ 0003h
RC4I2C_I2CPU_POSN                        equ 0004h
RC4I2C_I2CPU_POSITION                    equ 0004h
RC4I2C_I2CPU_SIZE                        equ 0002h
RC4I2C_I2CPU_LENGTH                      equ 0002h
RC4I2C_I2CPU_MASK                        equ 0030h
RC4I2C_I2CSLEW_POSN                      equ 0006h
RC4I2C_I2CSLEW_POSITION                  equ 0006h
RC4I2C_I2CSLEW_SIZE                      equ 0001h
RC4I2C_I2CSLEW_LENGTH                    equ 0001h
RC4I2C_I2CSLEW_MASK                      equ 0040h
RC4I2C_I2CTH0_POSN                       equ 0000h
RC4I2C_I2CTH0_POSITION                   equ 0000h
RC4I2C_I2CTH0_SIZE                       equ 0001h
RC4I2C_I2CTH0_LENGTH                     equ 0001h
RC4I2C_I2CTH0_MASK                       equ 0001h
RC4I2C_I2CTH1_POSN                       equ 0001h
RC4I2C_I2CTH1_POSITION                   equ 0001h
RC4I2C_I2CTH1_SIZE                       equ 0001h
RC4I2C_I2CTH1_LENGTH                     equ 0001h
RC4I2C_I2CTH1_MASK                       equ 0002h
RC4I2C_I2CPU0_POSN                       equ 0004h
RC4I2C_I2CPU0_POSITION                   equ 0004h
RC4I2C_I2CPU0_SIZE                       equ 0001h
RC4I2C_I2CPU0_LENGTH                     equ 0001h
RC4I2C_I2CPU0_MASK                       equ 0010h
RC4I2C_I2CPU1_POSN                       equ 0005h
RC4I2C_I2CPU1_POSITION                   equ 0005h
RC4I2C_I2CPU1_SIZE                       equ 0001h
RC4I2C_I2CPU1_LENGTH                     equ 0001h
RC4I2C_I2CPU1_MASK                       equ 0020h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 03A81h
// bitfield definitions
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 03A84h
// bitfield definitions
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 03A85h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 03A86h
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

