GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k42.inc
// Register: DMA2DCNT
#define DMA2DCNT DMA2DCNT
DMA2DCNT                                 equ 03BCAh

// Register: DMA2DCNTL
#define DMA2DCNTL DMA2DCNTL
DMA2DCNTL                                equ 03BCAh
// bitfield definitions
DMA2DCNTL_DCNT_POSN                      equ 0000h
DMA2DCNTL_DCNT_POSITION                  equ 0000h
DMA2DCNTL_DCNT_SIZE                      equ 0008h
DMA2DCNTL_DCNT_LENGTH                    equ 0008h
DMA2DCNTL_DCNT_MASK                      equ 00FFh
DMA2DCNTL_DCNT0_POSN                     equ 0000h
DMA2DCNTL_DCNT0_POSITION                 equ 0000h
DMA2DCNTL_DCNT0_SIZE                     equ 0001h
DMA2DCNTL_DCNT0_LENGTH                   equ 0001h
DMA2DCNTL_DCNT0_MASK                     equ 0001h
DMA2DCNTL_DCNT1_POSN                     equ 0001h
DMA2DCNTL_DCNT1_POSITION                 equ 0001h
DMA2DCNTL_DCNT1_SIZE                     equ 0001h
DMA2DCNTL_DCNT1_LENGTH                   equ 0001h
DMA2DCNTL_DCNT1_MASK                     equ 0002h
DMA2DCNTL_DCNT2_POSN                     equ 0002h
DMA2DCNTL_DCNT2_POSITION                 equ 0002h
DMA2DCNTL_DCNT2_SIZE                     equ 0001h
DMA2DCNTL_DCNT2_LENGTH                   equ 0001h
DMA2DCNTL_DCNT2_MASK                     equ 0004h
DMA2DCNTL_DCNT3_POSN                     equ 0003h
DMA2DCNTL_DCNT3_POSITION                 equ 0003h
DMA2DCNTL_DCNT3_SIZE                     equ 0001h
DMA2DCNTL_DCNT3_LENGTH                   equ 0001h
DMA2DCNTL_DCNT3_MASK                     equ 0008h
DMA2DCNTL_DCNT4_POSN                     equ 0004h
DMA2DCNTL_DCNT4_POSITION                 equ 0004h
DMA2DCNTL_DCNT4_SIZE                     equ 0001h
DMA2DCNTL_DCNT4_LENGTH                   equ 0001h
DMA2DCNTL_DCNT4_MASK                     equ 0010h
DMA2DCNTL_DCNT5_POSN                     equ 0005h
DMA2DCNTL_DCNT5_POSITION                 equ 0005h
DMA2DCNTL_DCNT5_SIZE                     equ 0001h
DMA2DCNTL_DCNT5_LENGTH                   equ 0001h
DMA2DCNTL_DCNT5_MASK                     equ 0020h
DMA2DCNTL_DCNT6_POSN                     equ 0006h
DMA2DCNTL_DCNT6_POSITION                 equ 0006h
DMA2DCNTL_DCNT6_SIZE                     equ 0001h
DMA2DCNTL_DCNT6_LENGTH                   equ 0001h
DMA2DCNTL_DCNT6_MASK                     equ 0040h
DMA2DCNTL_DCNT7_POSN                     equ 0007h
DMA2DCNTL_DCNT7_POSITION                 equ 0007h
DMA2DCNTL_DCNT7_SIZE                     equ 0001h
DMA2DCNTL_DCNT7_LENGTH                   equ 0001h
DMA2DCNTL_DCNT7_MASK                     equ 0080h
DMA2DCNTL_DMA2DCNT_POSN                  equ 0000h
DMA2DCNTL_DMA2DCNT_POSITION              equ 0000h
DMA2DCNTL_DMA2DCNT_SIZE                  equ 0008h
DMA2DCNTL_DMA2DCNT_LENGTH                equ 0008h
DMA2DCNTL_DMA2DCNT_MASK                  equ 00FFh
DMA2DCNTL_DMA2DCNT0_POSN                 equ 0000h
DMA2DCNTL_DMA2DCNT0_POSITION             equ 0000h
DMA2DCNTL_DMA2DCNT0_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT0_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT0_MASK                 equ 0001h
DMA2DCNTL_DMA2DCNT1_POSN                 equ 0001h
DMA2DCNTL_DMA2DCNT1_POSITION             equ 0001h
DMA2DCNTL_DMA2DCNT1_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT1_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT1_MASK                 equ 0002h
DMA2DCNTL_DMA2DCNT2_POSN                 equ 0002h
DMA2DCNTL_DMA2DCNT2_POSITION             equ 0002h
DMA2DCNTL_DMA2DCNT2_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT2_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT2_MASK                 equ 0004h
DMA2DCNTL_DMA2DCNT3_POSN                 equ 0003h
DMA2DCNTL_DMA2DCNT3_POSITION             equ 0003h
DMA2DCNTL_DMA2DCNT3_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT3_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT3_MASK                 equ 0008h
DMA2DCNTL_DMA2DCNT4_POSN                 equ 0004h
DMA2DCNTL_DMA2DCNT4_POSITION             equ 0004h
DMA2DCNTL_DMA2DCNT4_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT4_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT4_MASK                 equ 0010h
DMA2DCNTL_DMA2DCNT5_POSN                 equ 0005h
DMA2DCNTL_DMA2DCNT5_POSITION             equ 0005h
DMA2DCNTL_DMA2DCNT5_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT5_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT5_MASK                 equ 0020h
DMA2DCNTL_DMA2DCNT6_POSN                 equ 0006h
DMA2DCNTL_DMA2DCNT6_POSITION             equ 0006h
DMA2DCNTL_DMA2DCNT6_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT6_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT6_MASK                 equ 0040h
DMA2DCNTL_DMA2DCNT7_POSN                 equ 0007h
DMA2DCNTL_DMA2DCNT7_POSITION             equ 0007h
DMA2DCNTL_DMA2DCNT7_SIZE                 equ 0001h
DMA2DCNTL_DMA2DCNT7_LENGTH               equ 0001h
DMA2DCNTL_DMA2DCNT7_MASK                 equ 0080h

// Register: DMA2DCNTH
#define DMA2DCNTH DMA2DCNTH
DMA2DCNTH                                equ 03BCBh
// bitfield definitions
DMA2DCNTH_DCNT_POSN                      equ 0000h
DMA2DCNTH_DCNT_POSITION                  equ 0000h
DMA2DCNTH_DCNT_SIZE                      equ 0004h
DMA2DCNTH_DCNT_LENGTH                    equ 0004h
DMA2DCNTH_DCNT_MASK                      equ 000Fh
DMA2DCNTH_DCNT8_POSN                     equ 0000h
DMA2DCNTH_DCNT8_POSITION                 equ 0000h
DMA2DCNTH_DCNT8_SIZE                     equ 0001h
DMA2DCNTH_DCNT8_LENGTH                   equ 0001h
DMA2DCNTH_DCNT8_MASK                     equ 0001h
DMA2DCNTH_DCNT9_POSN                     equ 0001h
DMA2DCNTH_DCNT9_POSITION                 equ 0001h
DMA2DCNTH_DCNT9_SIZE                     equ 0001h
DMA2DCNTH_DCNT9_LENGTH                   equ 0001h
DMA2DCNTH_DCNT9_MASK                     equ 0002h
DMA2DCNTH_DCNT10_POSN                    equ 0002h
DMA2DCNTH_DCNT10_POSITION                equ 0002h
DMA2DCNTH_DCNT10_SIZE                    equ 0001h
DMA2DCNTH_DCNT10_LENGTH                  equ 0001h
DMA2DCNTH_DCNT10_MASK                    equ 0004h
DMA2DCNTH_DCNT11_POSN                    equ 0003h
DMA2DCNTH_DCNT11_POSITION                equ 0003h
DMA2DCNTH_DCNT11_SIZE                    equ 0001h
DMA2DCNTH_DCNT11_LENGTH                  equ 0001h
DMA2DCNTH_DCNT11_MASK                    equ 0008h
DMA2DCNTH_DMA2SCNT_POSN                  equ 0000h
DMA2DCNTH_DMA2SCNT_POSITION              equ 0000h
DMA2DCNTH_DMA2SCNT_SIZE                  equ 0004h
DMA2DCNTH_DMA2SCNT_LENGTH                equ 0004h
DMA2DCNTH_DMA2SCNT_MASK                  equ 000Fh
DMA2DCNTH_DMA2DCNT8_POSN                 equ 0000h
DMA2DCNTH_DMA2DCNT8_POSITION             equ 0000h
DMA2DCNTH_DMA2DCNT8_SIZE                 equ 0001h
DMA2DCNTH_DMA2DCNT8_LENGTH               equ 0001h
DMA2DCNTH_DMA2DCNT8_MASK                 equ 0001h
DMA2DCNTH_DMA2DCNT9_POSN                 equ 0001h
DMA2DCNTH_DMA2DCNT9_POSITION             equ 0001h
DMA2DCNTH_DMA2DCNT9_SIZE                 equ 0001h
DMA2DCNTH_DMA2DCNT9_LENGTH               equ 0001h
DMA2DCNTH_DMA2DCNT9_MASK                 equ 0002h
DMA2DCNTH_DMA2DCNT10_POSN                equ 0002h
DMA2DCNTH_DMA2DCNT10_POSITION            equ 0002h
DMA2DCNTH_DMA2DCNT10_SIZE                equ 0001h
DMA2DCNTH_DMA2DCNT10_LENGTH              equ 0001h
DMA2DCNTH_DMA2DCNT10_MASK                equ 0004h
DMA2DCNTH_DMA2DCNT11_POSN                equ 0003h
DMA2DCNTH_DMA2DCNT11_POSITION            equ 0003h
DMA2DCNTH_DMA2DCNT11_SIZE                equ 0001h
DMA2DCNTH_DMA2DCNT11_LENGTH              equ 0001h
DMA2DCNTH_DMA2DCNT11_MASK                equ 0008h

// Register: DMA2DPTR
#define DMA2DPTR DMA2DPTR
DMA2DPTR                                 equ 03BCCh

// Register: DMA2DPTRL
#define DMA2DPTRL DMA2DPTRL
DMA2DPTRL                                equ 03BCCh
// bitfield definitions
DMA2DPTRL_DPTR_POSN                      equ 0000h
DMA2DPTRL_DPTR_POSITION                  equ 0000h
DMA2DPTRL_DPTR_SIZE                      equ 0008h
DMA2DPTRL_DPTR_LENGTH                    equ 0008h
DMA2DPTRL_DPTR_MASK                      equ 00FFh
DMA2DPTRL_DPTR0_POSN                     equ 0000h
DMA2DPTRL_DPTR0_POSITION                 equ 0000h
DMA2DPTRL_DPTR0_SIZE                     equ 0001h
DMA2DPTRL_DPTR0_LENGTH                   equ 0001h
DMA2DPTRL_DPTR0_MASK                     equ 0001h
DMA2DPTRL_DPTR1_POSN                     equ 0001h
DMA2DPTRL_DPTR1_POSITION                 equ 0001h
DMA2DPTRL_DPTR1_SIZE                     equ 0001h
DMA2DPTRL_DPTR1_LENGTH                   equ 0001h
DMA2DPTRL_DPTR1_MASK                     equ 0002h
DMA2DPTRL_DPTR2_POSN                     equ 0002h
DMA2DPTRL_DPTR2_POSITION                 equ 0002h
DMA2DPTRL_DPTR2_SIZE                     equ 0001h
DMA2DPTRL_DPTR2_LENGTH                   equ 0001h
DMA2DPTRL_DPTR2_MASK                     equ 0004h
DMA2DPTRL_DPTR3_POSN                     equ 0003h
DMA2DPTRL_DPTR3_POSITION                 equ 0003h
DMA2DPTRL_DPTR3_SIZE                     equ 0001h
DMA2DPTRL_DPTR3_LENGTH                   equ 0001h
DMA2DPTRL_DPTR3_MASK                     equ 0008h
DMA2DPTRL_DPTR4_POSN                     equ 0004h
DMA2DPTRL_DPTR4_POSITION                 equ 0004h
DMA2DPTRL_DPTR4_SIZE                     equ 0001h
DMA2DPTRL_DPTR4_LENGTH                   equ 0001h
DMA2DPTRL_DPTR4_MASK                     equ 0010h
DMA2DPTRL_DPTR5_POSN                     equ 0005h
DMA2DPTRL_DPTR5_POSITION                 equ 0005h
DMA2DPTRL_DPTR5_SIZE                     equ 0001h
DMA2DPTRL_DPTR5_LENGTH                   equ 0001h
DMA2DPTRL_DPTR5_MASK                     equ 0020h
DMA2DPTRL_DPTR6_POSN                     equ 0006h
DMA2DPTRL_DPTR6_POSITION                 equ 0006h
DMA2DPTRL_DPTR6_SIZE                     equ 0001h
DMA2DPTRL_DPTR6_LENGTH                   equ 0001h
DMA2DPTRL_DPTR6_MASK                     equ 0040h
DMA2DPTRL_DPTR7_POSN                     equ 0007h
DMA2DPTRL_DPTR7_POSITION                 equ 0007h
DMA2DPTRL_DPTR7_SIZE                     equ 0001h
DMA2DPTRL_DPTR7_LENGTH                   equ 0001h
DMA2DPTRL_DPTR7_MASK                     equ 0080h
DMA2DPTRL_DMA2DPTR_POSN                  equ 0000h
DMA2DPTRL_DMA2DPTR_POSITION              equ 0000h
DMA2DPTRL_DMA2DPTR_SIZE                  equ 0008h
DMA2DPTRL_DMA2DPTR_LENGTH                equ 0008h
DMA2DPTRL_DMA2DPTR_MASK                  equ 00FFh
DMA2DPTRL_DMA2DPTR0_POSN                 equ 0000h
DMA2DPTRL_DMA2DPTR0_POSITION             equ 0000h
DMA2DPTRL_DMA2DPTR0_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR0_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR0_MASK                 equ 0001h
DMA2DPTRL_DMA2DPTR1_POSN                 equ 0001h
DMA2DPTRL_DMA2DPTR1_POSITION             equ 0001h
DMA2DPTRL_DMA2DPTR1_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR1_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR1_MASK                 equ 0002h
DMA2DPTRL_DMA2DPTR2_POSN                 equ 0002h
DMA2DPTRL_DMA2DPTR2_POSITION             equ 0002h
DMA2DPTRL_DMA2DPTR2_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR2_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR2_MASK                 equ 0004h
DMA2DPTRL_DMA2DPTR3_POSN                 equ 0003h
DMA2DPTRL_DMA2DPTR3_POSITION             equ 0003h
DMA2DPTRL_DMA2DPTR3_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR3_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR3_MASK                 equ 0008h
DMA2DPTRL_DMA2DPTR4_POSN                 equ 0004h
DMA2DPTRL_DMA2DPTR4_POSITION             equ 0004h
DMA2DPTRL_DMA2DPTR4_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR4_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR4_MASK                 equ 0010h
DMA2DPTRL_DMA2DPTR5_POSN                 equ 0005h
DMA2DPTRL_DMA2DPTR5_POSITION             equ 0005h
DMA2DPTRL_DMA2DPTR5_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR5_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR5_MASK                 equ 0020h
DMA2DPTRL_DMA2DPTR6_POSN                 equ 0006h
DMA2DPTRL_DMA2DPTR6_POSITION             equ 0006h
DMA2DPTRL_DMA2DPTR6_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR6_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR6_MASK                 equ 0040h
DMA2DPTRL_DMA2DPTR7_POSN                 equ 0007h
DMA2DPTRL_DMA2DPTR7_POSITION             equ 0007h
DMA2DPTRL_DMA2DPTR7_SIZE                 equ 0001h
DMA2DPTRL_DMA2DPTR7_LENGTH               equ 0001h
DMA2DPTRL_DMA2DPTR7_MASK                 equ 0080h

