GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k42.inc
// Register: U2ERRIR
#define U2ERRIR U2ERRIR
U2ERRIR                                  equ 03DE1h
// bitfield definitions
U2ERRIR_TXCIF_POSN                       equ 0000h
U2ERRIR_TXCIF_POSITION                   equ 0000h
U2ERRIR_TXCIF_SIZE                       equ 0001h
U2ERRIR_TXCIF_LENGTH                     equ 0001h
U2ERRIR_TXCIF_MASK                       equ 0001h
U2ERRIR_RXFOIF_POSN                      equ 0001h
U2ERRIR_RXFOIF_POSITION                  equ 0001h
U2ERRIR_RXFOIF_SIZE                      equ 0001h
U2ERRIR_RXFOIF_LENGTH                    equ 0001h
U2ERRIR_RXFOIF_MASK                      equ 0002h
U2ERRIR_RXBKIF_POSN                      equ 0002h
U2ERRIR_RXBKIF_POSITION                  equ 0002h
U2ERRIR_RXBKIF_SIZE                      equ 0001h
U2ERRIR_RXBKIF_LENGTH                    equ 0001h
U2ERRIR_RXBKIF_MASK                      equ 0004h
U2ERRIR_FERIF_POSN                       equ 0003h
U2ERRIR_FERIF_POSITION                   equ 0003h
U2ERRIR_FERIF_SIZE                       equ 0001h
U2ERRIR_FERIF_LENGTH                     equ 0001h
U2ERRIR_FERIF_MASK                       equ 0008h
U2ERRIR_CERIF_POSN                       equ 0004h
U2ERRIR_CERIF_POSITION                   equ 0004h
U2ERRIR_CERIF_SIZE                       equ 0001h
U2ERRIR_CERIF_LENGTH                     equ 0001h
U2ERRIR_CERIF_MASK                       equ 0010h
U2ERRIR_ABDOVF_POSN                      equ 0005h
U2ERRIR_ABDOVF_POSITION                  equ 0005h
U2ERRIR_ABDOVF_SIZE                      equ 0001h
U2ERRIR_ABDOVF_LENGTH                    equ 0001h
U2ERRIR_ABDOVF_MASK                      equ 0020h
U2ERRIR_PERIF_POSN                       equ 0006h
U2ERRIR_PERIF_POSITION                   equ 0006h
U2ERRIR_PERIF_SIZE                       equ 0001h
U2ERRIR_PERIF_LENGTH                     equ 0001h
U2ERRIR_PERIF_MASK                       equ 0040h
U2ERRIR_TXMTIF_POSN                      equ 0007h
U2ERRIR_TXMTIF_POSITION                  equ 0007h
U2ERRIR_TXMTIF_SIZE                      equ 0001h
U2ERRIR_TXMTIF_LENGTH                    equ 0001h
U2ERRIR_TXMTIF_MASK                      equ 0080h
U2ERRIR_U2TXCIF_POSN                     equ 0000h
U2ERRIR_U2TXCIF_POSITION                 equ 0000h
U2ERRIR_U2TXCIF_SIZE                     equ 0001h
U2ERRIR_U2TXCIF_LENGTH                   equ 0001h
U2ERRIR_U2TXCIF_MASK                     equ 0001h
U2ERRIR_U2RXFOIF_POSN                    equ 0001h
U2ERRIR_U2RXFOIF_POSITION                equ 0001h
U2ERRIR_U2RXFOIF_SIZE                    equ 0001h
U2ERRIR_U2RXFOIF_LENGTH                  equ 0001h
U2ERRIR_U2RXFOIF_MASK                    equ 0002h
U2ERRIR_U2RXBKIF_POSN                    equ 0002h
U2ERRIR_U2RXBKIF_POSITION                equ 0002h
U2ERRIR_U2RXBKIF_SIZE                    equ 0001h
U2ERRIR_U2RXBKIF_LENGTH                  equ 0001h
U2ERRIR_U2RXBKIF_MASK                    equ 0004h
U2ERRIR_U2FERIF_POSN                     equ 0003h
U2ERRIR_U2FERIF_POSITION                 equ 0003h
U2ERRIR_U2FERIF_SIZE                     equ 0001h
U2ERRIR_U2FERIF_LENGTH                   equ 0001h
U2ERRIR_U2FERIF_MASK                     equ 0008h
U2ERRIR_U2CERIF_POSN                     equ 0004h
U2ERRIR_U2CERIF_POSITION                 equ 0004h
U2ERRIR_U2CERIF_SIZE                     equ 0001h
U2ERRIR_U2CERIF_LENGTH                   equ 0001h
U2ERRIR_U2CERIF_MASK                     equ 0010h
U2ERRIR_U2ABDOVF_POSN                    equ 0005h
U2ERRIR_U2ABDOVF_POSITION                equ 0005h
U2ERRIR_U2ABDOVF_SIZE                    equ 0001h
U2ERRIR_U2ABDOVF_LENGTH                  equ 0001h
U2ERRIR_U2ABDOVF_MASK                    equ 0020h
U2ERRIR_U2PERIF_POSN                     equ 0006h
U2ERRIR_U2PERIF_POSITION                 equ 0006h
U2ERRIR_U2PERIF_SIZE                     equ 0001h
U2ERRIR_U2PERIF_LENGTH                   equ 0001h
U2ERRIR_U2PERIF_MASK                     equ 0040h
U2ERRIR_U2TXMTIF_POSN                    equ 0007h
U2ERRIR_U2TXMTIF_POSITION                equ 0007h
U2ERRIR_U2TXMTIF_SIZE                    equ 0001h
U2ERRIR_U2TXMTIF_LENGTH                  equ 0001h
U2ERRIR_U2TXMTIF_MASK                    equ 0080h

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
U2ERRIE                                  equ 03DE2h
// bitfield definitions
U2ERRIE_TXCIE_POSN                       equ 0000h
U2ERRIE_TXCIE_POSITION                   equ 0000h
U2ERRIE_TXCIE_SIZE                       equ 0001h
U2ERRIE_TXCIE_LENGTH                     equ 0001h
U2ERRIE_TXCIE_MASK                       equ 0001h
U2ERRIE_RXFOIE_POSN                      equ 0001h
U2ERRIE_RXFOIE_POSITION                  equ 0001h
U2ERRIE_RXFOIE_SIZE                      equ 0001h
U2ERRIE_RXFOIE_LENGTH                    equ 0001h
U2ERRIE_RXFOIE_MASK                      equ 0002h
U2ERRIE_RXBKIE_POSN                      equ 0002h
U2ERRIE_RXBKIE_POSITION                  equ 0002h
U2ERRIE_RXBKIE_SIZE                      equ 0001h
U2ERRIE_RXBKIE_LENGTH                    equ 0001h
U2ERRIE_RXBKIE_MASK                      equ 0004h
U2ERRIE_FERIE_POSN                       equ 0003h
U2ERRIE_FERIE_POSITION                   equ 0003h
U2ERRIE_FERIE_SIZE                       equ 0001h
U2ERRIE_FERIE_LENGTH                     equ 0001h
U2ERRIE_FERIE_MASK                       equ 0008h
U2ERRIE_CERIE_POSN                       equ 0004h
U2ERRIE_CERIE_POSITION                   equ 0004h
U2ERRIE_CERIE_SIZE                       equ 0001h
U2ERRIE_CERIE_LENGTH                     equ 0001h
U2ERRIE_CERIE_MASK                       equ 0010h
U2ERRIE_ABDOVE_POSN                      equ 0005h
U2ERRIE_ABDOVE_POSITION                  equ 0005h
U2ERRIE_ABDOVE_SIZE                      equ 0001h
U2ERRIE_ABDOVE_LENGTH                    equ 0001h
U2ERRIE_ABDOVE_MASK                      equ 0020h
U2ERRIE_PERIE_POSN                       equ 0006h
U2ERRIE_PERIE_POSITION                   equ 0006h
U2ERRIE_PERIE_SIZE                       equ 0001h
U2ERRIE_PERIE_LENGTH                     equ 0001h
U2ERRIE_PERIE_MASK                       equ 0040h
U2ERRIE_TXMTIE_POSN                      equ 0007h
U2ERRIE_TXMTIE_POSITION                  equ 0007h
U2ERRIE_TXMTIE_SIZE                      equ 0001h
U2ERRIE_TXMTIE_LENGTH                    equ 0001h
U2ERRIE_TXMTIE_MASK                      equ 0080h
U2ERRIE_U2TXCIE_POSN                     equ 0000h
U2ERRIE_U2TXCIE_POSITION                 equ 0000h
U2ERRIE_U2TXCIE_SIZE                     equ 0001h
U2ERRIE_U2TXCIE_LENGTH                   equ 0001h
U2ERRIE_U2TXCIE_MASK                     equ 0001h
U2ERRIE_U2RXFOIE_POSN                    equ 0001h
U2ERRIE_U2RXFOIE_POSITION                equ 0001h
U2ERRIE_U2RXFOIE_SIZE                    equ 0001h
U2ERRIE_U2RXFOIE_LENGTH                  equ 0001h
U2ERRIE_U2RXFOIE_MASK                    equ 0002h
U2ERRIE_U2RXBKIE_POSN                    equ 0002h
U2ERRIE_U2RXBKIE_POSITION                equ 0002h
U2ERRIE_U2RXBKIE_SIZE                    equ 0001h
U2ERRIE_U2RXBKIE_LENGTH                  equ 0001h
U2ERRIE_U2RXBKIE_MASK                    equ 0004h
U2ERRIE_U2FERIE_POSN                     equ 0003h
U2ERRIE_U2FERIE_POSITION                 equ 0003h
U2ERRIE_U2FERIE_SIZE                     equ 0001h
U2ERRIE_U2FERIE_LENGTH                   equ 0001h
U2ERRIE_U2FERIE_MASK                     equ 0008h
U2ERRIE_U2CERIE_POSN                     equ 0004h
U2ERRIE_U2CERIE_POSITION                 equ 0004h
U2ERRIE_U2CERIE_SIZE                     equ 0001h
U2ERRIE_U2CERIE_LENGTH                   equ 0001h
U2ERRIE_U2CERIE_MASK                     equ 0010h
U2ERRIE_U2ABDOVE_POSN                    equ 0005h
U2ERRIE_U2ABDOVE_POSITION                equ 0005h
U2ERRIE_U2ABDOVE_SIZE                    equ 0001h
U2ERRIE_U2ABDOVE_LENGTH                  equ 0001h
U2ERRIE_U2ABDOVE_MASK                    equ 0020h
U2ERRIE_U2PERIE_POSN                     equ 0006h
U2ERRIE_U2PERIE_POSITION                 equ 0006h
U2ERRIE_U2PERIE_SIZE                     equ 0001h
U2ERRIE_U2PERIE_LENGTH                   equ 0001h
U2ERRIE_U2PERIE_MASK                     equ 0040h
U2ERRIE_U2TXMTIE_POSN                    equ 0007h
U2ERRIE_U2TXMTIE_POSITION                equ 0007h
U2ERRIE_U2TXMTIE_SIZE                    equ 0001h
U2ERRIE_U2TXMTIE_LENGTH                  equ 0001h
U2ERRIE_U2TXMTIE_MASK                    equ 0080h

// Register: U1RXB
#define U1RXB U1RXB
U1RXB                                    equ 03DE8h
// bitfield definitions
U1RXB_RXB_POSN                           equ 0000h
U1RXB_RXB_POSITION                       equ 0000h
U1RXB_RXB_SIZE                           equ 0008h
U1RXB_RXB_LENGTH                         equ 0008h
U1RXB_RXB_MASK                           equ 00FFh

